# Pandas

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv")
df

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

In [4]:
df['id'].max()

5

In [5]:
df['price'].max()

1200

In [6]:
df['brand'][df['price']>1000]

1    Audi
2     BMW
Name: brand, dtype: object

In [7]:
df.brand[df.price>1000]

1    Audi
2     BMW
Name: brand, dtype: object

In [8]:
df.shape

(5, 4)

In [10]:
df.head()     # Top Rows

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

In [12]:
df.tail()     # Bottom rows

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

In [14]:
df[0:2]     # Indexing the dataframe

   id brand model  price
0   1  Benz    A3   1000
1   2  Audi    Q7   1200

In [15]:
df.columns

Index(['id', 'brand', 'model', 'price'], dtype='object')

In [18]:
df.info()          # Details of the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      5 non-null      int64
 1   brand   5 non-null      object
 2   model   5 non-null      object
 3   price   5 non-null      int64
dtypes: int64(2), object(2)
memory usage: 292.0+ bytes

In [20]:
df.describe()         # Show the statistics of dataframe

             id       price
count  5.000000     5.00000
mean   3.000000  1020.00000
std    1.581139   148.32397
min    1.000000   800.00000
25%    2.000000  1000.00000
50%    3.000000  1000.00000
75%    4.000000  1100.00000
max    5.000000  1200.00000

# Working with different file format

1 . CSV

In [21]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv")
df

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

2 . EXCEL

In [3]:
import openpyxl
df = pd.read_excel("C:\\Users\\Admin\\Downloads\\sales_data.xlsx")
df

        Ship Mode Customer ID      Customer Name    Segment
0  Standard Class    BM-11575      Brendan Murry  Corporate
1  Standard Class    BM-11575      Brendan Murry  Corporate
2  Standard Class    BM-11575      Brendan Murry  Corporate
3     First Class    LR-16915       Lena Radford   Consumer
4  Standard Class    CA-12310  Christine Abelman  Corporate
5  Standard Class    CA-12310  Christine Abelman  Corporate
6  Standard Class    CA-12310  Christine Abelman  Corporate

3 . Dictionary

In [27]:
dict = {
    "ID" : [1,2,3,4,5],
    "Name" : ["A","B","C","D","E"],
    "Age" : [10,11,12,13,14]
}

In [29]:
df = pd.DataFrame(dict)
df

   ID Name  Age
0   1    A   10
1   2    B   11
2   3    C   12
3   4    D   13
4   5    E   14

4 . List of Tuple

In [30]:
list = [
    (1,2),
    ("Bio","Math")
]

In [31]:
df = pd.DataFrame(list, columns = ["ID","Subject"])
df

    ID Subject
0    1       2
1  Bio    Math

5. List of Dictionary

In [5]:
list_dict = [
    {"Id" :1, "Sub" : "Bio"},
    {"Id" : 2, "Sub" : "Math"}
]

In [6]:
df = pd.DataFrame(list_dict)
df

   Id   Sub
0   1   Bio
1   2  Math

# Read and Write files

# 1. CSV File

1. Reading CSV file

In [8]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv")
df

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

In [10]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv")
df

  data Unnamed: 1 Unnamed: 2 Unnamed: 3
0   id      brand      model      price
1    1       Benz         A3       1000
2    2       Audi         Q7       1200
3    3        BMW         C2       1100
4    4       TATA      Tiago       1000
5    5        Kia      sonet        800

In [21]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",skiprows=1)
df                                                 # Skip the first row

   2  Audi     Q7  1200
0  3   BMW     C2  1100
1  4  TATA  Tiago  1000
2  5   Kia  sonet   800

Otherwise we can use 'header' for skip the row

In [22]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",header=1)
df                                              # Skip the first row

   2  Audi     Q7  1200
0  3   BMW     C2  1100
1  4  TATA  Tiago  1000
2  5   Kia  sonet   800

In [23]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",header=None)
df                                       # Without header

   0     1      2     3
0  1  Benz     A3  1000
1  2  Audi     Q7  1200
2  3   BMW     C2  1100
3  4  TATA  Tiago  1000
4  5   Kia  sonet   800

In [24]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",names = ['id','brand','model','price'])
df                                     # Add the header

   id brand  model  price
0   1  Benz     A3   1000
1   2  Audi     Q7   1200
2   3   BMW     C2   1100
3   4  TATA  Tiago   1000
4   5   Kia  sonet    800

In [27]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv", nrows=3)
df                             # Read the specific No of rows

   id brand model  price
0   1  Benz    A3   1000
1   2  Audi    Q7   1200
2   3   BMW    C2   1100

In [29]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv")
df                         # CSV file with 'na' values

   id brand          model  price na_values
0   1  Benz             A3   1000        20
1   2  Audi             Q7   1200        na
2   3   BMW             C2   1100        34
3   4  TATA          Tiago   1000        na
4   5   Kia  Not Aplicable    800        na

In [33]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",na_values =["Not Aplicable", "na",-1])
df

   id brand  model  price  na_values  negative value  values
0   1  Benz     A3   1000       20.0             NaN     1.0
1   2  Audi     Q7   1200        NaN             1.0     2.0
2   3   BMW     C2   1100       34.0             2.0     3.0
3   4  TATA  Tiago   1000        NaN             3.0     4.0
4   5   Kia    NaN    800        NaN             4.0     NaN

In [36]:
df = pd.read_csv("C:\\Users\\Admin\\Downloads\\car.csv",na_values ={
    "model" : ['Not Aplicable','na'],
    "na_values" : ['Not Aplicable','na',],
    "values" : ['Not Aplicable', 'na',-1]
})
df

   id brand  model  price  na_values  negative value  values
0   1  Benz     A3   1000       20.0              -1     1.0
1   2  Audi     Q7   1200        NaN               1     2.0
2   3   BMW     C2   1100       34.0               2     3.0
3   4  TATA  Tiago   1000        NaN               3     4.0
4   5   Kia    NaN    800        NaN               4     NaN

2. Writting CSV file

In [43]:
df.to_csv("new.csv")       # Create new csv file

In [46]:
df.to_csv("new.csv",index=False)   # Create new file withot index

In [49]:
df.columns

Index(['id', 'brand', 'model', 'price', 'na_values', 'negative value',
       'values'],
      dtype='object')

In [51]:
df.to_csv("new.csv",columns=['id','brand','model'])    # Create new csv with specific column

In [58]:
df.to_csv("new.csv",columns=['id','brand','model'],index=False)    # Create new csv with specific column without index

In [62]:
df.to_csv("new.csv",columns=['id','brand','model'],header=False)   # Create new csv without header

# 2 . EXCEL file

1 . Reading file

In [5]:
df = pd.read_excel("C:\\Users\\Admin\\Downloads\\sales_data.xlsx")
df

        Ship Mode Customer ID      Customer Name    Segment
0  Standard Class    BM-11575      Brendan Murry  Corporate
1  Standard Class    BM-11575      Brendan Murry  Corporate
2  Standard Class    BM-11575      Brendan Murry  Corporate
3     First Class    LR-16915       Lena Radford   Consumer
4  Standard Class    CA-12310  Christine Abelman  Corporate
5  Standard Class    CA-12310  Christine Abelman  Corporate
6  Standard Class    CA-12310  Christine Abelman  Corporate

In [9]:
df = pd.read_excel("C:\\Users\\Admin\\Downloads\\sales_data.xlsx")
df.head()

        Ship Mode Customer ID      Customer Name    Segment
0  Standard Class    BM-11575      Brendan Murry  Corporate
1  Standard Class    BM-11575      Brendan Murry  Corporate
2  Standard Class    BM-11575      Brendan Murry  Corporate
3     First Class    LR-16915                 na   Consumer
4  Standard Class    CA-12310  Christine Abelman  Corporate

In [8]:
def converted_Customer_name(cell):
    if cell == 'na':
        return 'Akshay'
    return cell
df = pd.read_excel("C:\\Users\\Admin\\Downloads\\sales_data.xlsx",converters={'Customer Name' : converted_Customer_name})
df

        Ship Mode Customer ID      Customer Name    Segment
0  Standard Class    BM-11575      Brendan Murry  Corporate
1  Standard Class    BM-11575      Brendan Murry  Corporate
2  Standard Class    BM-11575      Brendan Murry  Corporate
3     First Class    LR-16915             Akshay   Consumer
4  Standard Class    CA-12310  Christine Abelman  Corporate
5  Standard Class    CA-12310  Christine Abelman  Corporate
6  Standard Class    CA-12310  Christine Abelman  Corporate

2 . Writting EXCEL file

In [11]:
df.to_excel("new.xlsx")